typeset_config = {
    "厦门大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "黑体",
            "字号": 15,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 1,  # 0-单倍  1-1.5倍  2-双倍   3-最小  4-固定值  5-多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [6, False, 0.5]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "黑体",
            "字号": 15,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [6, False, 0.5]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "黑体",
            "字号": 14,
            "加粗": True,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [6, False, 0.5]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "黑体",
            "字号": 12,
            "加粗": True,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [6, False, 0.5]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "黑体",
            "字号": 14,
            "加粗": True,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "黑体",
            "西文字体": "黑体",
            "字号": 12,
            "加粗": True,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.35, 1],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "宋体",
            "西文字体": "宋体",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.35, 1],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面设置": {  # 厘米
            "上边距": 2.54,
            "下边距": 2.54,
            "左边距": 3.17,
            "右边距": 3.17,
            "装订线": 0.5,
            "距边界-页眉": 1.5,
            "距边界-页脚": 1.75,
            "奇偶页不同": True,
            "装订线位置": 0

        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "是",
            "奇数页眉内容": "各章标题",
            "偶数页眉内容": "论文题目（需自填）",
            "线型样式": "1",
            "预览样式": "",
            "线型宽度": "0.5磅"
        },
        "表格设置": {
            "表格类型": "不等线三线表",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "对外经济贸易大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Arial",
            "字号": 16,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 4 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "黑体",
            "字号": 16,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 4 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "黑体",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 22,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [6, False, 0.5]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "黑体",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 22,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [6, False, 0.5]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 22,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "黑体",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 22,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "黑体",
            "西文字体": "黑体",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.18, 1],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 22,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "黑体",
            "西文字体": "黑体",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.35, 2],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 22,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "3.6厘米",
            "下边距": "3.6厘米",
            "左边距": "3.1厘米",
            "右边距": "3.1厘米",
            "页眉边距": "NA",
            "页脚边距": "1.75厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "没有页眉",
            "奇数页眉内容": "",
            "偶数页眉内容": "",
            "线型样式": "",
            "预览样式": "",
            "线型宽度": ""
        },
        "表格设置": {
            "表格类型": "普通表格",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "河海大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 18,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [7.5, False, 0],  # [磅,自动,行]
            "间距-段后": [7.5, False, 0]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 18,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [7.5, False, 0],  # [磅,自动,行]
            "间距-段后": [7.5, False, 0]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 16,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [7.5, False, 0],  # [磅,自动,行]
            "间距-段后": [7.5, False, 0]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 15,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [7.5, False, 0],  # [磅,自动,行]
            "间距-段后": [7.5, False, 0]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.25 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [6, False, 0.5]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": True,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.25 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0],  # [磅,自动,行]
            "间距-段后": [6, False, 0]
        },
        "TOC 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.25 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.18, 1],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.25 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "2.54厘米",
            "下边距": "2.54厘米",
            "左边距": "2.7厘米",
            "右边距": "2.7厘米",
            "页眉边距": "1.5厘米",
            "页脚边距": "1.75厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "是",
            "奇数页眉内容": "河海大学专业学位硕士学位论文",
            "偶数页眉内容": "各章标题",
            "线型样式": "1",
            "预览样式": "",
            "线型宽度": "0.5磅"
        },
        "表格设置": {
            "表格类型": "不等线三线表",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "山东大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 15,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 1,  # 0 单倍  1 1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [18, False, 1.5],  # [磅,自动,行]
            "间距-段后": [18, False, 1.5]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 15,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 1,  # 0 单倍  1 1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [18, False, 1.5],  # [磅,自动,行]
            "间距-段后": [18, False, 1.5]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [12, False, 0],  # [磅,自动,行]
            "间距-段后": [12, False, 0]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0],  # [磅,自动,行]
            "间距-段后": [6, False, 0]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": True,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": True,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.37, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.74, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "3厘米",
            "下边距": "3厘米",
            "左边距": "3厘米",
            "右边距": "2.75厘米",
            "页眉边距": "1.5厘米",
            "页脚边距": "1.75厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "否",
            "奇数页眉内容": "山东大学硕士学位论文",
            "偶数页眉内容": "",
            "线型样式": "10",
            "预览样式": "",
            "线型宽度": "3磅"
        },
        "表格设置": {
            "表格类型": "普通表格",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "西北大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 16,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [24, False, 0],  # [磅,自动,行]
            "间距-段后": [18, False, 0]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 16,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [24, False, 0],  # [磅,自动,行]
            "间距-段后": [18, False, 0]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [18, False, 0],  # [磅,自动,行]
            "间距-段后": [12, False, 0]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0],  # [磅,自动,行]
            "间距-段后": [6, False, 0]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.34, 1.9],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.79, 4.5],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "2.5厘米",
            "下边距": "2.5厘米",
            "左边距": "3厘米",
            "右边距": "2厘米",
            "页眉边距": "1.5厘米",
            "页脚边距": "1.75厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "是",
            "奇数页眉内容": "各章标题",
            "偶数页眉内容": "西北大学硕士专业学位论文",
            "线型样式": "1",
            "预览样式": "",
            "线型宽度": "0.5磅"
        },
        "表格设置": {
            "表格类型": "普通表格",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "中国人民大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 16,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [24, False, 2]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 18,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [36, False, 3]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Arial",
            "字号": 15,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [24, False, 2],  # [磅,自动,行]
            "间距-段后": [24, False, 2]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Arial",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.18, 1],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 1": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.18, 1],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.18, 1],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "4.5厘米",
            "下边距": "4厘米",
            "左边距": "3.5厘米",
            "右边距": "3厘米",
            "页眉边距": "1.5厘米",
            "页脚边距": "1.75厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "否",
            "奇数页眉内容": "文章题目（自填）",
            "偶数页眉内容": "",
            "线型样式": "1",
            "预览样式": "",
            "线型宽度": "0.5磅"
        },
        "表格设置": {
            "表格类型": "不等线三线表",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "武汉大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 18,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [12, False, 1],  # [磅,自动,行]
            "间距-段后": [12, False, 1]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 18,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [12, False, 1],  # [磅,自动,行]
            "间距-段后": [12, False, 1]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 16,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [12, False, 1],  # [磅,自动,行]
            "间距-段后": [12, False, 1]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [6, False, 0.5]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 1": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": True,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": True,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.35, 2],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": True,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.71, 4],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "2.5厘米",
            "下边距": "2.5厘米",
            "左边距": "2.6厘米",
            "右边距": "2.6厘米",
            "页眉边距": "1.5厘米",
            "页脚边距": "1.75厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "是",
            "奇数页眉内容": "文章题目（自填）",
            "偶数页眉内容": "武汉大学硕士学位论文",
            "线型样式": "1",
            "预览样式": "",
            "线型宽度": "0.5磅"
        },
        "表格设置": {
            "表格类型": "等线三线表",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "中国地质大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 16,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [24, False, 0],  # [磅,自动,行]
            "间距-段后": [18, False, 0]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 16,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 2.41 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [17, False, 0],  # [磅,自动,行]
            "间距-段后": [16.5, False, 0]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 15,
            "加粗": True,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.73 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [13, False, 0],  # [磅,自动,行]
            "间距-段后": [13, False, 0]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": True,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.25 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [12, False, 0],  # [磅,自动,行]
            "间距-段后": [6, False, 0]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.25 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.25 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.75 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.35, 2],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.35, 2],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "2.54厘米",
            "下边距": "2.54厘米",
            "左边距": "3.17厘米",
            "右边距": "3.17厘米",
            "页眉边距": "1.5厘米",
            "页脚边距": "1.75厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "是",
            "奇数页眉内容": "中国地质大学硕士学位论文",
            "偶数页眉内容": "作者姓名：论文题目",
            "线型样式": "1",
            "预览样式": "",
            "线型宽度": "0.75磅"
        },
        "表格设置": {
            "表格类型": "粗边框表格",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "电子科技大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 15,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [24, False, 0],  # [磅,自动,行]
            "间距-段后": [18, False, 0]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 15,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [24, False, 0],  # [磅,自动,行]
            "间距-段后": [18, False, 0]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [18, False, 0],  # [磅,自动,行]
            "间距-段后": [6, False, 0]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [12, False, 0],  # [磅,自动,行]
            "间距-段后": [6, False, 0]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.35, 2],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.71, 4],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "3厘米",
            "下边距": "3厘米",
            "左边距": "3厘米",
            "右边距": "3厘米",
            "页眉边距": "2厘米",
            "页脚边距": "2厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "是",
            "奇数页眉内容": "本章标题",
            "偶数页眉内容": "电子科技大学硕士学位论文",
            "线型样式": "1",
            "预览样式": "",
            "线型宽度": "0.75磅"
        },
        "表格设置": {
            "表格类型": "普通表格",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "西南交通大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 18,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [17, False, 0],  # [磅,自动,行]
            "间距-段后": [16.5, False, 0]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 18,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [17, False, 0],  # [磅,自动,行]
            "间距-段后": [16.5, False, 0]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 15,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [13, False, 0],  # [磅,自动,行]
            "间距-段后": [13, False, 0]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [13, False, 0],  # [磅,自动,行]
            "间距-段后": [13, False, 0]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0],  # [磅,自动,行]
            "间距-段后": [6, False, 0]
        },
        "TOC 2": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.37, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.74, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "2.54厘米",
            "下边距": "2.54厘米",
            "左边距": "2.6厘米",
            "右边距": "2.6厘米",
            "页眉边距": "1.5厘米",
            "页脚边距": "1.75厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "否",
            "奇数页眉内容": "西南交通大学硕士研究生学位论文",
            "偶数页眉内容": "西南交通大学硕士研究生学位论文",
            "线型样式": "9",
            "预览样式": "",
            "线型宽度": "3磅"
        },
        "表格设置": {
            "表格类型": "等线三线表",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "重庆大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 16,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [12, False, 1],  # [磅,自动,行]
            "间距-段后": [12, False, 1]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 16,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [12, False, 1],  # [磅,自动,行]
            "间距-段后": [12, False, 1]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 15,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.35, 2],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.71, 2],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "3厘米",
            "下边距": "2.5厘米",
            "左边距": "2.5厘米",
            "右边距": "2.5厘米",
            "页眉边距": "1.6厘米",
            "页脚边距": "1.7厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "是",
            "奇数页眉内容": "重庆大学硕士学位论文",
            "偶数页眉内容": "各章章名",
            "线型样式": "1",
            "预览样式": "",
            "线型宽度": "0.75磅"
        },
        "表格设置": {
            "表格类型": "等线三线表",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "浙江工业大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Arial",
            "字号": 16,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.25 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [12, False, 2],  # [磅,自动,行]
            "间距-段后": [24, False, 2]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Arial",
            "字号": 16,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.25 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [12, False, 2],  # [磅,自动,行]
            "间距-段后": [24, False, 2]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [24, False, 0],  # [磅,自动,行]
            "间距-段后": [12, False, 0]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.25 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [13, False, 0],  # [磅,自动,行]
            "间距-段后": [13, False, 0]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.25 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.25 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.35, 2],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.35, 2],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "2.54厘米",
            "下边距": "2.54厘米",
            "左边距": "3.17厘米",
            "右边距": "3.17厘米",
            "页眉边距": "1.8厘米",
            "页脚边距": "1.8厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "是",
            "奇数页眉内容": "论文标题名",
            "偶数页眉内容": "浙江工业大学硕士学位论文",
            "线型样式": "1",
            "预览样式": "",
            "线型宽度": "0.75磅"
        },
        "表格设置": {
            "表格类型": "等线三线表",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "中央财经大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Arial",
            "字号": 18,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [24, False, 0],  # [磅,自动,行]
            "间距-段后": [18, False, 0]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 16,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [24, False, 0],  # [磅,自动,行]
            "间距-段后": [18, False, 0]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [24, False, 0],  # [磅,自动,行]
            "间距-段后": [6, False, 0]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [12, False, 0],  # [磅,自动,行]
            "间距-段后": [6, False, 0]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0],  # [磅,自动,行]
            "间距-段后": [6, False, 0]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.35, 2],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "3.8厘米",
            "下边距": "3.8厘米",
            "左边距": "3.2厘米",
            "右边距": "3.2厘米",
            "页眉边距": "3.0厘米",
            "页脚边距": "2.0厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "否",
            "奇数页眉内容": "章标题",
            "偶数页眉内容": "章标题",
            "线型样式": "1",
            "预览样式": "",
            "线型宽度": "0.75磅"
        },
        "表格设置": {
            "表格类型": "普通表格",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "南京航空航天大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 15,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 15,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [18, False, 1.5],  # [磅,自动,行]
            "间距-段后": [18, False, 1.5]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [6, False, 0.5]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [6, False, 0.5]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.35, 2],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.71, 4],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "3.3厘米",
            "下边距": "3.3厘米",
            "左边距": "3.0厘米",
            "右边距": "2.8厘米",
            "页眉边距": "2.6厘米",
            "页脚边距": "2.6厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "是",
            "奇数页眉内容": "南京航空航天大学硕士学位论文",
            "偶数页眉内容": "论文题目",
            "线型样式": "1",
            "预览样式": "",
            "线型宽度": ""
        },
        "表格设置": {
            "表格类型": "等线三线表",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "石河子大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 16,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.2 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 16,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.2 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.2 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.2 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [13, False, 0],  # [磅,自动,行]
            "间距-段后": [13, False, 0]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.2 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.2 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 0,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.35, 2],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.71, 4],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "3厘米",
            "下边距": "2.5厘米",
            "左边距": "2.5厘米",
            "右边距": "2.5厘米",
            "页眉边距": "2.3厘米",
            "页脚边距": "1.5厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "否",
            "奇数页眉内容": "论文题目",
            "偶数页眉内容": "论文题目",
            "线型样式": "1",
            "预览样式": "",
            "线型宽度": "0.75磅"
        },
        "表格设置": {
            "表格类型": "不等线三线表",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "太原科技大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 15,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [6, False, 0.5]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "黑体",
            "字号": 16,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 22,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [6, False, 0.5]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 22,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [3.6, False, 0.3],  # [磅,自动,行]
            "间距-段后": [3.6, False, 0.3]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 22,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 22,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [3.6, False, 0.3],  # [磅,自动,行]
            "间距-段后": [3.6, False, 0.3]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 22,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.37, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 22,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.74, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 22,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "2.54厘米",
            "下边距": "2.54厘米",
            "左边距": "3.17厘米",
            "右边距": "3.17厘米",
            "页眉边距": "1.5厘米",
            "页脚边距": "1.75厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "是",
            "奇数页眉内容": "章节标题",
            "偶数页眉内容": "论文题目",
            "线型样式": "1",
            "预览样式": "",
            "线型宽度": "0.75磅"
        },
        "表格设置": {
            "表格类型": "普通表格",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "湖北工业大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 18,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.3 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [23, False, 0],  # [磅,自动,行]
            "间距-段后": [23, False, 0]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 18,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.3 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [23, False, 0],  # [磅,自动,行]
            "间距-段后": [23, False, 0]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "黑体",
            "字号": 16,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.3 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [12, False, 0],  # [磅,自动,行]
            "间距-段后": [12, False, 0]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "黑体",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.3 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.3 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.3 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.3 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.25, 1.44],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.3 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.62, 3.51],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.3 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "楷体_GB2312",
            "西文字体": "Times New Roman",
            "字号": 15,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "3厘米",
            "下边距": "3厘米",
            "左边距": "3厘米",
            "右边距": "3厘米",
            "页眉边距": "2厘米",
            "页脚边距": "2厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "否",
            "奇数页眉内容": "湖 北 工 业 大 学 硕 士 学 位 论 文",
            "偶数页眉内容": "湖 北 工 业 大 学 硕 士 学 位 论 文",
            "线型样式": "13",
            "预览样式": "",
            "线型宽度": "3磅"
        },
        "表格设置": {
            "表格类型": "不等线三线表",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "华中科技大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 16,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [12, False, 1]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 16,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [12, False, 1]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.1 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.1 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.1 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "2.54厘米",
            "下边距": "2.54厘米",
            "左边距": "3.17厘米",
            "右边距": "3.17厘米",
            "页眉边距": "1.5厘米",
            "页脚边距": "1.75厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "否",
            "奇数页眉内容": "华中科技大学硕士学位论文",
            "偶数页眉内容": "华中科技大学硕士学位论文",
            "线型样式": "7",
            "预览样式": "",
            "线型宽度": "3磅"
        },
        "表格设置": {
            "表格类型": "等线三线表",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "合肥工业大学": {
        "标题": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 18,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [18, False, 1.5]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 16,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [12, False, 1],  # [磅,自动,行]
            "间距-段后": [12, False, 1]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [6, False, 0.5]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": True,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [6, False, 0.5]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [6, False, 0.5]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.35, 2],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.71, 2],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "2.54厘米",
            "下边距": "2.54厘米",
            "左边距": "3厘米",
            "右边距": "3厘米",
            "页眉边距": "1.5厘米",
            "页脚边距": "1.5厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "是",
            "奇数页眉内容": "章节标题",
            "偶数页眉内容": "合肥工业大学硕士学位论文",
            "线型样式": "1",
            "预览样式": "",
            "线型宽度": "0.75磅"
        },
        "表格设置": {
            "表格类型": "等线三线表",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "湖南大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 18,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [12, False, 1],  # [磅,自动,行]
            "间距-段后": [12, False, 1]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 18,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [12, False, 1],  # [磅,自动,行]
            "间距-段后": [12, False, 1]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 15,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [12, False, 0],  # [磅,自动,行]
            "间距-段后": [12, False, 0]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": True,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0],  # [磅,自动,行]
            "间距-段后": [6, False, 0]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 1": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.35, 2],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.71, 4],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "2.2厘米",
            "下边距": "2.2厘米",
            "左边距": "2.5厘米",
            "右边距": "2.5厘米",
            "页眉边距": "1.3厘米",
            "页脚边距": "1.3厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "是",
            "奇数页眉内容": "硕士学位论文",
            "偶数页眉内容": "章节标题",
            "线型样式": "9",
            "预览样式": "",
            "线型宽度": "15磅"
        },
        "表格设置": {
            "表格类型": "两侧开放",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "上海财经大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Arial",
            "字号": 18,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [24, False, 0],  # [磅,自动,行]
            "间距-段后": [18, False, 0]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 16,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [24, False, 0],  # [磅,自动,行]
            "间距-段后": [18, False, 0]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [24, False, 0],  # [磅,自动,行]
            "间距-段后": [6, False, 0]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [12, False, 0],  # [磅,自动,行]
            "间距-段后": [6, False, 0]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 20,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0],  # [磅,自动,行]
            "间距-段后": [12, False, 0]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.37, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.74, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "3.8厘米",
            "下边距": "3.8厘米",
            "左边距": "3.2厘米",
            "右边距": "3.2厘米",
            "页眉边距": "3.0厘米",
            "页脚边距": "3.0厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "否",
            "奇数页眉内容": "章节标题",
            "偶数页眉内容": "章节标题",
            "线型样式": "1",
            "预览样式": "",
            "线型宽度": "0.75磅"
        },
        "表格设置": {
            "表格类型": "不等线三线表",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    # "天津大学": {
    #     "标题": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 1": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 2": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 3": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "正文": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "题注": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 1": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 2": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 3": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页眉": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页脚": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页面布局": {
    #         "上边距": "2.75厘米",
    #         "下边距": "2.54厘米",
    #         "左边距": "3.57厘米",
    #         "右边距": "2.77厘米",
    #         "页眉边距": "1.5厘米",
    #         "页脚边距": "1.75厘米"
    #     },
    #     "页眉/页脚进阶设置": {
    #         "是否奇偶页不同": "是",
    #         "奇数页眉内容": "章标题",
    #         "偶数页眉内容": "天津大学硕士学位论文",
    #         "线型样式": "1",
    #         "预览样式": "",
    #         "线型宽度": "0.75磅"
    #     },
    #     "表格设置": {
    #         "表格类型": "不等线三线表",
    #         "表格字体大小": "10.5磅",
    #         "表格左右对齐": "居中",
    #         "表格上下对齐": "居中",
    #         "中文字体": "宋体",
    #         "英文字体": "Times New Roman"
    #     },
    # },
    # "中南财经政法大学": {
    #     "标题": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 1": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 2": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 3": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "正文": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "题注": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 1": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 2": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 3": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页眉": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页脚": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页面布局": {
    #         "上边距": "3厘米",
    #         "下边距": "2.5厘米",
    #         "左边距": "2.5厘米",
    #         "右边距": "2.5厘米",
    #         "页眉边距": "1.5厘米",
    #         "页脚边距": "1.5厘米"
    #     },
    #     "页眉/页脚进阶设置": {
    #         "是否奇偶页不同": "是",
    #         "奇数页眉内容": "论文题目",
    #         "偶数页眉内容": "章标题",
    #         "线型样式": "1",
    #         "预览样式": "",
    #         "线型宽度": "0.75磅"
    #     },
    #     "表格设置": {
    #         "表格类型": "不等线三线表",
    #         "表格字体大小": "10.5磅",
    #         "表格左右对齐": "居中",
    #         "表格上下对齐": "居中",
    #         "中文字体": "宋体",
    #         "英文字体": "Times New Roman"
    #     },
    #
    # },
    # "西安交通大学": {
    #     "标题": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 1": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 2": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 3": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "正文": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "题注": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 1": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 2": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 3": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页眉": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页脚": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页面布局": {
    #         "上边距": "3厘米",
    #         "下边距": "2.5厘米",
    #         "左边距": "2.6厘米",
    #         "右边距": "2.6厘米",
    #         "页眉边距": "2厘米",
    #         "页脚边距": "1.75厘米"
    #     },
    #     "页眉/页脚进阶设置": {
    #         "是否奇偶页不同": "是",
    #         "奇数页眉内容": "章标题",
    #         "偶数页眉内容": "西安交通大学硕士学位论文",
    #         "线型样式": "7",
    #         "预览样式": "",
    #         "线型宽度": "0.75磅"
    #     },
    #     "表格设置": {
    #         "表格类型": "不等线三线表",
    #         "表格字体大小": "10.5磅",
    #         "表格左右对齐": "居中",
    #         "表格上下对齐": "居中",
    #         "中文字体": "宋体",
    #         "英文字体": "Times New Roman"
    #     },
    # },
    # "首都经济贸易大学": {
    #     "标题": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 1": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 2": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 3": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "正文": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "题注": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 1": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 2": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 3": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页眉": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页脚": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页面布局": {
    #         "上边距": "2.5厘米",
    #         "下边距": "2.5厘米",
    #         "左边距": "3厘米",
    #         "右边距": "2厘米",
    #         "页眉边距": "1.5厘米",
    #         "页脚边距": "1.5厘米"
    #     },
    #     "页眉/页脚进阶设置": {
    #         "是否奇偶页不同": "是",
    #         "奇数页眉内容": "首都经济贸易大学硕士学位论文",
    #         "偶数页眉内容": "章标题",
    #         "线型样式": "1",
    #         "预览样式": "",
    #         "线型宽度": "0.75磅"
    #     },
    #     "表格设置": {
    #         "表格类型": "不等线三线表",
    #         "表格字体大小": "10.5磅",
    #         "表格左右对齐": "居中",
    #         "表格上下对齐": "居中",
    #         "中文字体": "宋体",
    #         "英文字体": "Times New Roman"
    #     },
    # },
    "沈阳工业大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 16,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [12, False, 1],  # [磅,自动,行]
            "间距-段后": [12, False, 1]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 16,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [12, False, 1],  # [磅,自动,行]
            "间距-段后": [12, False, 1]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 22,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 4,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 22,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.49, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0.99, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "2.54厘米",
            "下边距": "2.54厘米",
            "左边距": "3.17厘米",
            "右边距": "3.17厘米",
            "页眉边距": "1.75厘米",
            "页脚边距": "1.75厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "是",
            "奇数页眉内容": "章节标题",
            "偶数页眉内容": "沈阳工业大学XX（专业名称）硕士专业学位论文",
            "线型样式": "1",
            "预览样式": "",
            "线型宽度": "0.75磅"
        },
        "表格设置": {
            "表格类型": "普通表格",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    "同济大学": {
        "标题": {
            "中文字体": "黑体",
            "西文字体": "Arial",
            "字号": 16,
            "加粗": True,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [12, False, 1]
        },
        "标题 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 16,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 1,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [12, False, 1]
        },
        "标题 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 2,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "标题 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 3,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [6, False, 0.5],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "正文": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 12,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0.35, 2],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "题注": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 10.5,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 1": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.1 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 2": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.1 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "TOC 3": {
            "中文字体": "黑体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 3,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 5,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1.1 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页眉": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 14,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页脚": {
            "中文字体": "宋体",
            "西文字体": "Times New Roman",
            "字号": 9,
            "加粗": False,
            "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
            "缩进-右侧": [0, 0],  # [厘米,字符]
            "缩进-左侧": [0, 0],
            "缩进-特殊-首行": [0, 0],  # [厘米,字符]
            "大纲级别": 10,
            "间距-行距": 0,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
            "间距-设置值": 1,  # 如果是行就需要转化为磅  1行 = 12磅
            "间距-段前": [0, False, 0],  # [磅,自动,行]
            "间距-段后": [0, False, 0]
        },
        "页面布局": {
            "上边距": "2.54厘米",
            "下边距": "2.54厘米",
            "左边距": "3.17厘米",
            "右边距": "3.17厘米",
            "页眉边距": "2厘米",
            "页脚边距": "2厘米"
        },
        "页眉/页脚进阶设置": {
            "是否奇偶页不同": "是",
            "奇数页眉内容": "章节标题",
            "偶数页眉内容": "同济大学 硕士学位论文 中文题目",
            "线型样式": "1",
            "预览样式": "",
            "线型宽度": "0.75磅"
        },
        "表格设置": {
            "表格类型": "粗边框表格",
            "表格字体大小": "10.5磅",
            "表格左右对齐": "居中",
            "表格上下对齐": "居中",
            "中文字体": "宋体",
            "英文字体": "Times New Roman"
        },
    },
    # "南京财经大学": {
    #     "标题": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 1": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 2": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 3": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "正文": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "题注": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 1": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 2": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 3": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页眉": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页脚": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页面布局": {
    #         "上边距": "2.54厘米",
    #         "下边距": "2.54厘米",
    #         "左边距": "3.17厘米",
    #         "右边距": "3.17厘米",
    #         "页眉边距": "1.5厘米",
    #         "页脚边距": "1.75厘米"
    #     },
    #     "页眉/页脚进阶设置": {
    #         "是否奇偶页不同": "否",
    #         "奇数页眉内容": "南京财经大学XX（专业名称）学位论文",
    #         "偶数页眉内容": "南京财经大学XX（专业名称）学位论文",
    #         "线型样式": "1",
    #         "预览样式": "",
    #         "线型宽度": "0.75磅"
    #     },
    #     "表格设置": {
    #         "表格类型": "不等线三线表",
    #         "表格字体大小": "10.5磅",
    #         "表格左右对齐": "居中",
    #         "表格上下对齐": "居中",
    #         "中文字体": "宋体",
    #         "英文字体": "Times New Roman"
    #     },
    # },
    # "东南大学": {
    #     "标题": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 1": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 2": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 3": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "正文": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "题注": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 1": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 2": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 3": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页眉": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页脚": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页面布局": {
    #         "上边距": "2厘米",
    #         "下边距": "2厘米",
    #         "左边距": "2厘米",
    #         "右边距": "2厘米",
    #         "页眉边距": "1.5厘米",
    #         "页脚边距": "1.75厘米"
    #     },
    #     "页眉/页脚进阶设置": {
    #         "是否奇偶页不同": "是",
    #         "奇数页眉内容": "章节标题",
    #         "偶数页眉内容": "东南大学硕士学位论文",
    #         "线型样式": "1",
    #         "预览样式": "",
    #         "线型宽度": "0.75磅"
    #     },
    #     "表格设置": {
    #         "表格类型": "不等线三线表",
    #         "表格字体大小": "10.5磅",
    #         "表格左右对齐": "居中",
    #         "表格上下对齐": "居中",
    #         "中文字体": "宋体",
    #         "英文字体": "Times New Roman"
    #     },
    # },
    # "武汉科技大学": {
    #     "标题": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 1": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 2": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "标题 3": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "正文": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "题注": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 1": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 2": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "TOC 3": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页眉": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页脚": {
    #         "中文字体": "黑体",
    #         "西文字体": "Times New Roman",
    #         "字号": 15,
    #         "加粗": True,
    #         "对齐方式": 1,  # 1 居中  3 完全两端对齐  0左对齐  2 右对齐
    #         "缩进-右侧": [0, 0],  # [厘米,字符]
    #         "缩进-左侧": [0, 0],
    #         "缩进-特殊-首行": [0, 0],  # [厘米,字符]
    #         "大纲级别": 1,
    #         "间距-行距": 1,  # 1  0 单倍   1.5倍  2 双倍   3 最小  4 固定值  5 多倍
    #         "间距-设置值": 1.5 * 12,  # 如果是行就需要转化为磅  1行 = 12磅
    #         "间距-段前": [5, False, 1],  # [磅,自动,行]
    #         "间距-段后": [5, False, 1]
    #     },
    #     "页面布局": {
    #         "上边距": "3厘米",
    #         "下边距": "3厘米",
    #         "左边距": "2.8厘米",
    #         "右边距": "2.8厘米",
    #         "页眉边距": "2.6厘米",
    #         "页脚边距": "2.4厘米"
    #     },
    #     "页眉/页脚进阶设置": {
    #         "是否奇偶页不同": "否",
    #         "奇数页眉内容": "武汉科技大学硕士学位论文",
    #         "偶数页眉内容": "武汉科技大学硕士学位论文",
    #         "线型样式": "1",
    #         "预览样式": "",
    #         "线型宽度": "0.75磅"
    #     },
    #     "表格设置": {
    #         "表格类型": "不等线三线表",
    #         "表格字体大小": "10.5磅",
    #         "表格左右对齐": "居中",
    #         "表格上下对齐": "居中",
    #         "中文字体": "宋体",
    #         "英文字体": "Times New Roman"
    #     },
    # }
}
